## Percentage Mappings For Narrower Age Ranges

In [39]:
import csv
import pandas as pd
import numpy as np
import re
from matplotlib import pyplot as plt

In [40]:
# define a list of columns we want to keep
keep = ['Characteristic','15 to 24 years', '25 to 29 years', '30 to 34 years', '35 to 39 years', '40 to 44 years','45 to 49 years',
       '50 to 54 years', '55 to 59 years', '60 to 64 years','65 to 69 years',
       '70 to 74 years', '75 years and over']


def format_census_data(file, household_type):
    file = file.dropna()
    file = file.reindex(file.index.drop(0))
    
    file_lean = file[keep]
    pct = pd.melt(file_lean, id_vars=['Characteristic'], value_vars=keep[1:], var_name='narrow_age_bucket', value_name='narrow_count')
    pct.narrow_count = pd.to_numeric(pct['narrow_count'])*1000
    pct['household_type'] = household_type
    
    return pct

Read in all the data sets loaded from the [US Census](https://www.census.gov/data/tables/time-series/demo/income-poverty/cps-hinc/hinc-02.html#par_textimage_12).

In [41]:
mar = pd.read_csv('married_households.csv')
sing_dad = pd.read_csv('single_dads.csv')
sing_mom = pd.read_csv('single_moms.csv')
male_alone = pd.read_csv('male_alone_no_fam.csv')
male_not_alone = pd.read_csv('male_not_alone_no_fam.csv')
fm_nf_na = pd.read_csv('female_non_fam_not_living_alone.csv')
fm_nf_la = pd.read_csv('female_non_fam_living_alone.csv')

In [42]:
mar.head()

,Characteristic,Total,Total Under 65 years,15 to 24 years,Total.1,25 to 29 years,30 to 34 years,Total.2,35 to 39 years,40 to 44 years,...,50 to 54 years,Total.4,55 to 59 years,60 to 64 years,Total 65 years and over,Total.5,65 to 69 years,70 to 74 years,75 years and over,Mean age of householder
0,....Total,61241.0,46664.0,887.0,8415.0,3080.0,5334.0,12267.0,6302.0,5965.0,...,6109.0,12700.0,6551.0,6149.0,14577.0,9751.0,5607.0,4145.0,4825.0,52.0
1,"Under $5,000",800.0,534.0,16.0,123.0,42.0,81.0,119.0,67.0,51.0,...,40.0,177.0,91.0,86.0,266.0,148.0,70.0,78.0,118.0,54.8
2,"$5,000 to $9,999",377.0,267.0,11.0,62.0,24.0,38.0,60.0,38.0,22.0,...,24.0,91.0,43.0,47.0,110.0,63.0,29.0,34.0,47.0,53.6
3,"$10,000 to $14,999",640.0,452.0,12.0,90.0,41.0,49.0,103.0,58.0,46.0,...,43.0,162.0,74.0,87.0,189.0,111.0,56.0,55.0,77.0,54.1
4,"$15,000 to $19,999",1025.0,580.0,20.0,130.0,51.0,79.0,112.0,68.0,44.0,...,82.0,198.0,87.0,112.0,446.0,233.0,140.0,93.0,213.0,58.0

Format the data

In [43]:
mar1 = format_census_data(mar, 'married')
sing_dad1 = format_census_data(sing_dad, 'single_dad')
sing_mom1 = format_census_data(sing_mom, 'single_mom')
male_alone1 = format_census_data(male_alone, 'male_alone')
male_not_alone1 = format_census_data(male_not_alone, 'male_not_alone')
fm_nf_na1 = format_census_data(fm_nf_na, 'single_woman')
fm_nf_la1 = format_census_data(fm_nf_la, 'single_woman')

In [44]:
total = pd.concat([mar1, sing_dad1, sing_mom1, male_alone1, male_not_alone1, fm_nf_na1, fm_nf_la1])

In [45]:
total.head(10)

       Characteristic narrow_age_bucket  narrow_count household_type
0        Under $5,000    15 to 24 years       16000.0        married
1    $5,000 to $9,999    15 to 24 years       11000.0        married
2  $10,000 to $14,999    15 to 24 years       12000.0        married
3  $15,000 to $19,999    15 to 24 years       20000.0        married
4  $20,000 to $24,999    15 to 24 years       52000.0        married
5  $25,000 to $29,999    15 to 24 years       49000.0        married
6  $30,000 to $34,999    15 to 24 years       55000.0        married
7  $35,000 to $39,999    15 to 24 years       84000.0        married
8  $40,000 to $44,999    15 to 24 years       54000.0        married
9  $45,000 to $49,999    15 to 24 years       68000.0        married

In [46]:
total.narrow_count.sum()

127562000.0

In [47]:
total.household_type.unique()

array(['married', 'single_dad', 'single_mom', 'male_alone',
       'male_not_alone', 'single_woman'], dtype=object)

In [48]:
total[['household_type', 'narrow_count']].groupby('household_type').agg('sum')

                narrow_count
household_type
male_alone        16009000.0
male_not_alone     4996000.0
married           61242000.0
single_dad         6425000.0
single_mom        15422000.0
single_woman      23468000.0

In [49]:
total.narrow_age_bucket.unique()

array(['15 to 24 years', '25 to 29 years', '30 to 34 years',
       '35 to 39 years', '40 to 44 years', '45 to 49 years',
       '50 to 54 years', '55 to 59 years', '60 to 64 years',
       '65 to 69 years', '70 to 74 years', '75 years and over'],
      dtype=object)

Next we define a function to classify the narrow age groups into the same larger age groups we have in our market data. This will allow us to join the two datasets along the wider age variable.

In [50]:
def classify_ages(str_range):
    
    under_25 = ['15 to 24 years']
    
    tier2 = ['25 to 29 years', '30 to 34 years',
       '35 to 39 years', '40 to 44 years']
    
    tier3 = ['45 to 49 years',
       '50 to 54 years', '55 to 59 years', '60 to 64 years',]
    
    tier4 = ['65 to 69 years', '70 to 74 years', '75 years and over']
    
    if str_range in under_25:
        return 'under 25'
    
    elif str_range in tier2:
        return '25 to 44'
    
    elif str_range in tier3:
        return '45 to 65'
    
    elif str_range in tier4:
        return '65 +'
    else:
        return 'no idea'

We also define a function to map the narrow income ranges to the wider income ranges that we want to use in our market data set.

In [51]:
def classify_income(str_range):
    
    under_75k = ['Under $5,000', '$5,000 to $9,999', '$10,000 to $14,999',
       '$15,000 to $19,999', '$20,000 to $24,999', '$25,000 to $29,999',
       '$30,000 to $34,999', '$35,000 to $39,999', '$40,000 to $44,999',
       '$45,000 to $49,999', '$50,000 to $54,999', '$55,000 to $59,999',
       '$60,000 to $64,999', '$65,000 to $69,999', '$70,000 to $74,999']
    
    tier2 = ['$75,000 to $79,999', '$80,000 to $84,999', '$85,000 to $89,999',
       '$90,000 to $94,999', '$95,000 to $99,999']
    
    tier3 = ['$100,000 to $104,999',
       '$105,000 to $109,999', '$110,000 to $114,999',
       '$115,000 to $119,999', '$120,000 to $124,999']
       
    tier4 = ['$125,000 to $129,999', '$130,000 to $134,999',
       '$135,000 to $139,999', '$140,000 to $144,999',
       '$145,000 to $149,999']
    
    tier5 = ['$150,000 to $154,999',
       '$155,000 to $159,999', '$160,000 to $164,999',
       '$165,000 to $169,999', '$170,000 to $174,999',
       '$175,000 to $179,999', '$180,000 to $184,999',
       '$185,000 to $189,999', '$190,000 to $194,999',
       '$195,000 to $199,999']
    
    tier6 = ['$200,000 and over']
    
    if str_range in under_75k:
        return 'Under 75k'
    
    elif str_range in tier2:
        return '$75,000 to $99,999'
    
    elif str_range in tier3:
        return '$100,000 to $124,999'
    
    elif str_range in tier4:
        return '$125,000 to $149,999'
    
    elif str_range in tier5:
        return '$150,000 to $199,999'
    else:
        return '$200,000 or more'

In [52]:
total['wide_income'] = total['Characteristic'].apply(classify_income)
total['age_bracket'] = total['narrow_age_bucket'].apply(classify_ages)
total.head()

,Characteristic,narrow_age_bucket,narrow_count,household_type,wide_income,age_bracket
0,"Under $5,000",15 to 24 years,16000.0,married,Under 75k,under 25
1,"$5,000 to $9,999",15 to 24 years,11000.0,married,Under 75k,under 25
2,"$10,000 to $14,999",15 to 24 years,12000.0,married,Under 75k,under 25
3,"$15,000 to $19,999",15 to 24 years,20000.0,married,Under 75k,under 25
4,"$20,000 to $24,999",15 to 24 years,52000.0,married,Under 75k,under 25

In [53]:
total.narrow_count.sum()

127562000.0

In [54]:
total.shape

(3444, 6)

Now we have a dataset tallying 127 million households along narrow age ranges, the same household types as our market data, the wide income ranges as our market data, and the same wide age brackets as our market data set. Next we will create a new data set that sums the total count of households by wide income range, wide age range, and household type. We will use these totals to calculate the percentage of narrow age ranges within those.

In [55]:
# grand counts by household type
grands = total[['household_type', 'narrow_count', 'age_bracket','wide_income']].groupby(['household_type', 'wide_income', 'age_bracket']).agg('sum').reset_index()
grands.head()

  household_type           wide_income age_bracket  narrow_count
0     male_alone  $100,000 to $124,999    25 to 44      294000.0
1     male_alone  $100,000 to $124,999    45 to 65      299000.0
2     male_alone  $100,000 to $124,999        65 +      165000.0
3     male_alone  $100,000 to $124,999    under 25       17000.0
4     male_alone  $125,000 to $149,999    25 to 44      144000.0

In [56]:
grands[['household_type', 'narrow_count']].groupby('household_type').agg('sum')

                narrow_count
household_type
male_alone        16009000.0
male_not_alone     4996000.0
married           61242000.0
single_dad         6425000.0
single_mom        15422000.0
single_woman      23468000.0

In [57]:
grands.narrow_count.sum()

127562000.0

Above we verify that our `grands` dataset still has the same number of households as our `total` dataset, just at a different level of granularity. Now we can merge our totals (the _slices_ of data containing narrow age ranges) with our grand totals on household type, wide income, and wide age. From the resulting dataset we can then calculate the percentage of households in a narrow range that make up a wider age range. We will use these percentages estimate household counts along narrower age slices within our market data.

In [58]:
# narrow counts by age and income
slices = total[['household_type', 'narrow_count', 'narrow_age_bucket', 'wide_income', 'age_bracket']].groupby(['age_bracket','household_type', 'narrow_age_bucket', 'wide_income']).agg('sum').reset_index()
pct_map = pd.merge(slices, grands, on=['household_type', 'wide_income', 'age_bracket'])
pct_map['pct'] = pct_map.narrow_count_x / pct_map.narrow_count_y
#pct_map[['age_bracket', 'household_type', 'wide_income','pct']].groupby(['age_bracket', 'wide_income', 'household_type']).agg('sum').head()
pct_map.head()

,age_bracket,household_type,narrow_age_bucket,wide_income,narrow_count_x,narrow_count_y,pct
0,25 to 44,male_alone,25 to 29 years,"$100,000 to $124,999",62000.0,294000.0,0.210884
1,25 to 44,male_alone,30 to 34 years,"$100,000 to $124,999",71000.0,294000.0,0.241497
2,25 to 44,male_alone,35 to 39 years,"$100,000 to $124,999",97000.0,294000.0,0.329932
3,25 to 44,male_alone,40 to 44 years,"$100,000 to $124,999",64000.0,294000.0,0.217687
4,25 to 44,male_alone,25 to 29 years,"$125,000 to $149,999",38000.0,144000.0,0.263889

In [59]:
pct_map.narrow_count_x.sum()

127562000.0

Looks pretty good so far. However notice the NaN values in the `pct` column for the _male_alone_ household type. Apparently there aren't any households recorded with male householders, living alone, in the $150k and over income bracket. We can force those NaN's to 0 so it won't cause issues for us later.

In [60]:
pct_map.query('household_type == "male_alone"' ).tail()

,age_bracket,household_type,narrow_age_bucket,wide_income,narrow_count_x,narrow_count_y,pct
397,under 25,male_alone,15 to 24 years,"$125,000 to $149,999",7000.0,7000.0,1.0
398,under 25,male_alone,15 to 24 years,"$150,000 to $199,999",0.0,0.0,NaN
399,under 25,male_alone,15 to 24 years,"$200,000 or more",0.0,0.0,NaN
400,under 25,male_alone,15 to 24 years,"$75,000 to $99,999",59000.0,59000.0,1.0
401,under 25,male_alone,15 to 24 years,Under 75k,664000.0,664000.0,1.0

In [61]:
pct_map['pct'] = pct_map['pct'].fillna((0))

In [62]:
pct_map.query('household_type == "male_alone"' ).tail()

,age_bracket,household_type,narrow_age_bucket,wide_income,narrow_count_x,narrow_count_y,pct
397,under 25,male_alone,15 to 24 years,"$125,000 to $149,999",7000.0,7000.0,1.0
398,under 25,male_alone,15 to 24 years,"$150,000 to $199,999",0.0,0.0,0.0
399,under 25,male_alone,15 to 24 years,"$200,000 or more",0.0,0.0,0.0
400,under 25,male_alone,15 to 24 years,"$75,000 to $99,999",59000.0,59000.0,1.0
401,under 25,male_alone,15 to 24 years,Under 75k,664000.0,664000.0,1.0

Now we will pickle this dataframe (aka save it) so we can pull it into our primary notebook and extrapolate to narrower age ranges.

In [63]:
pct_map.to_pickle('pct_map')

In [64]:
pct_map['grand_total'] = pct_map.narrow_count_x.sum()
overview = pct_map[['household_type', 'grand_total', 'narrow_count_x']].groupby(['household_type', 'grand_total']).agg('sum').reset_index()
overview['pct'] = overview.narrow_count_x / overview.grand_total
overview.head(10)
overview.to_pickle('overview')    #to save the dataframe, df to 123.pkl

In [65]:
overview.narrow_count_x.sum()

127562000.0

In [66]:
overview

   household_type  grand_total  narrow_count_x       pct
0      male_alone  127562000.0      16009000.0  0.125500
1  male_not_alone  127562000.0       4996000.0  0.039165
2         married  127562000.0      61242000.0  0.480096
3      single_dad  127562000.0       6425000.0  0.050368
4      single_mom  127562000.0      15422000.0  0.120898
5    single_woman  127562000.0      23468000.0  0.183973

In [67]:
overview.pct.sum()

1.0

In [ ]:
mapping = pct_map[['household_type', 'narrow_age_bucket', 'pct', 'wide_income', 'wide_ages']]
mapping[['household_type', 'pct']].groupby(['household_type']).agg('sum')
mapping.head()